app/views/tickets/index.html.haml

                = simple_form_for(t) do |f|
                  = collection_select(:ticket, :status, Status.all, :status_type, :status_type)
---
SELECT "tickets".* FROM "tickets"