app/controllers/tickets_controller.rb

	def create
    @ticket = Ticket.new(ticket_params)
    if user_signed_in?
      redirect_to tickets_url
      flash[:error] = "Ticket create only customer"
      return
    end
    key = "#{('A'..'Z').to_a.sample(3).join}-#{rand(100000..999999)}"
    @ticket.key = key
    @ticket.status = Status.find_by(status_type: 'Waiting for Staff Response').status_type
		if @ticket.save
---
INSERT INTO "tickets" ("created_at", "department", "email", "key", "name", "subject", "text", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

	def show
    @ticket = Ticket.find_by(key: params[:id])
---
SELECT  "tickets".* FROM "tickets"  WHERE "tickets"."key" IS NULL LIMIT 1

  def set_ticket
    @ticket = Ticket.find_by_id(params[:id])
---
SELECT  "tickets".* FROM "tickets"  WHERE "tickets"."id" IS NULL LIMIT 1