app/controllers/users_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1
---
  def set_user
    @user = User.find_by_id(params[:id])